app/controllers/resumes_controller.rb

SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def viewed
      resume = Resume.find(params[:id])

SELECT "resumes".* FROM "resumes"
---
  def index
    @resumes = Resume.all

SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "view_histories" ("created_at", "ip", "resume_id", "time_viewed", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def show
    @resume = Resume.find(params[:id])

    vh = ViewHistory.new(:time_viewed => Time.now, :ip => request.remote_ip, :resume_id =>@resume.id )
    vh.save

SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @resume = Resume.find(params[:id])

INSERT INTO "resumes" ("city", "created_at", "email", "name", "note", "phone", "state", "street", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @resume = Resume.new(params[:resume])

    respond_to do |format|
      if @resume.save

SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @resume = Resume.find(params[:id])

SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 1]]
---
  def destroy
    @resume = Resume.find(params[:id])
    @resume.destroy